In [1]:
import numpy as np
import pandas as pd

In [5]:
stringdata=pd.Series(['Karachi','Lahore',np.nan,'Islamabad'])
stringdata

0      Karachi
1       Lahore
2          NaN
3    Islamabad
dtype: object

In [12]:
#stringdata[stringdata.isnull()]
stringdata.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
#data.dropna() Inplace=true--> changes in origional values
data.dropna(inplace=True)
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.fillna({1:0,2:1,0:3})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  1.0
2  3.0  0.0  1.0
3  3.0  6.5  3.0

In [18]:
data.dropna()#whole row deleted!!

     0    1    2
0  1.0  6.5  3.0

In [25]:
data[3]=NA
data

     0    1    2   4   3
0  1.0  6.5  3.0 NaN NaN
1  1.0  NaN  NaN NaN NaN
2  NaN  NaN  NaN NaN NaN
3  NaN  6.5  3.0 NaN NaN

In [26]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df=pd.DataFrame(np.random.rand(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.749827       NaN       NaN
1  0.242596       NaN       NaN
2  0.334101       NaN  0.794369
3  0.048521       NaN  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [35]:
#thresh=1 atleat one row must be notnull 
#df.dropna(thresh=1)
#df.dropna(thresh=2)
df.dropna(thresh=3)

          0         1         2
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [36]:
df

          0         1         2
0  0.749827       NaN       NaN
1  0.242596       NaN       NaN
2  0.334101       NaN  0.794369
3  0.048521       NaN  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [37]:
df.fillna({0:3,1:5,2:2})

          0         1         2
0  0.749827  5.000000  2.000000
1  0.242596  5.000000  2.000000
2  0.334101  5.000000  0.794369
3  0.048521  5.000000  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [40]:
df

          0         1         2
0  0.749827       NaN       NaN
1  0.242596       NaN       NaN
2  0.334101       NaN  0.794369
3  0.048521       NaN  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [41]:
df.fillna(method='bfill')# not cahnge for ffill

          0         1         2
0  0.749827  0.857832  0.794369
1  0.242596  0.857832  0.794369
2  0.334101  0.857832  0.794369
3  0.048521  0.857832  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [42]:
df.fillna(method='bfill',limit=2) #

          0         1         2
0  0.749827       NaN  0.794369
1  0.242596       NaN  0.794369
2  0.334101  0.857832  0.794369
3  0.048521  0.857832  0.933415
4  0.083066  0.857832  0.448543
5  0.426009  0.541570  0.928886
6  0.795294  0.457939  0.933490

In [51]:
dp = pd.DataFrame({'K1':['one','two']*3,'k2':[3,2,2,2,2,2]})
dp

    K1  k2
0  one   3
1  two   2
2  one   2
3  two   2
4  one   2
5  two   2

In [52]:
dp.duplicated()

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [53]:
dp.drop_duplicates()

    K1  k2
0  one   3
1  two   2
2  one   2

In [57]:
dp.drop_duplicates(['K1'])

    K1  k2
0  one   3
1  two   2

In [58]:
dp.drop_duplicates(['K1','k2'])

    K1  k2
0  one   3
1  two   2
2  one   2

In [59]:
dp.drop_duplicates(['K1'],keep='last')

    K1  k2
4  one   2
5  two   2

In [60]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [61]:
meat_to_animal = {  'bacon': 'pig',  'pulled pork': 'pig',  'pastrami': 'cow',  'corned beef': 'cow',  'honey ham': 'pig',  'nova lox': 'salmon'}

In [62]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [63]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [64]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data['animal']=lowercased.map(meat_to_animal)

In [66]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
d=pd.Series([1,4,-3,10,5,-13])
d

0     1
1     4
2    -3
3    10
4     5
5    -3
dtype: int64

In [68]:
d.replace(-3,np.nan)

0     1.0
1     4.0
2     NaN
3    10.0
4     5.0
5     NaN
dtype: float64

In [70]:
d.replace([-3,-13],[0,0])

0     1
1     4
2     0
3    10
4     5
5     0
dtype: int64

In [71]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [73]:
#data.rename(index=str.lower,columns=str.upper)
#data.rename(index={'ohio':'Karachi','london':'lahore'},columns={'three':'peshawar'})

In [74]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18,25,35,60,100]

In [75]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [76]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [77]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [79]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64